data/outputs/node/test4.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.133 (be patient)


Server Software:        
Server Hostname:        192.168.1.133
Server Port:            8080

Document Path:          /
Document Length:        223 bytes

Concurrency Level:      50
Time taken for tests:   6.545 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      323000 bytes
HTML transferred:       223000 bytes
Requests per second:    152.80 [#/sec] (mean)
Time per request:       327.233 [ms] (mean)
Time per request:       6.545 [ms] (mean, across all concurrent requests)
Transfer rate:          48.20 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    6  34.9      0    1028
Processing:     0  317 261.9    186    1409
Waiting:        0  151 157.5    109    1215
Total:          0  323 265.0    189    1409

Percentage of the requests served within a certain time (ms)
  50%    189
  66%    403
  75%    428
  80%    469
  90%    532
  95%   1199
  98%   1312
  99%   1362
 100%   1409 (longest request)