data/outputs/node/test5.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.133 (be patient)


Server Software:        
Server Hostname:        192.168.1.133
Server Port:            8080

Document Path:          /
Document Length:        223 bytes

Concurrency Level:      50
Time taken for tests:   4.635 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      323000 bytes
HTML transferred:       223000 bytes
Requests per second:    215.77 [#/sec] (mean)
Time per request:       231.725 [ms] (mean)
Time per request:       4.635 [ms] (mean, across all concurrent requests)
Transfer rate:          68.06 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    5  33.5      0    1045
Processing:     0  222 226.2    175    1222
Waiting:        0  150 226.0    109    1222
Total:          0  226 228.3    178    1231

Percentage of the requests served within a certain time (ms)
  50%    178
  66%    187
  75%    190
  80%    194
  90%    206
  95%   1191
  98%   1222
  99%   1222
 100%   1231 (longest request)