data/outputs/node/test8.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.133 (be patient)


Server Software:        
Server Hostname:        192.168.1.133
Server Port:            8080

Document Path:          /
Document Length:        223 bytes

Concurrency Level:      50
Time taken for tests:   3.539 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      323000 bytes
HTML transferred:       223000 bytes
Requests per second:    282.54 [#/sec] (mean)
Time per request:       176.967 [ms] (mean)
Time per request:       3.539 [ms] (mean, across all concurrent requests)
Transfer rate:          89.12 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   6.2      0      31
Processing:     0  169  29.1    169     241
Waiting:        0   90  51.1     91     211
Total:          0  173  29.1    172     250

Percentage of the requests served within a certain time (ms)
  50%    172
  66%    183
  75%    187
  80%    196
  90%    209
  95%    219
  98%    226
  99%    229
 100%    250 (longest request)