data/outputs/node/test9.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.133 (be patient)


Server Software:        
Server Hostname:        192.168.1.133
Server Port:            8080

Document Path:          /
Document Length:        223 bytes

Concurrency Level:      50
Time taken for tests:   3.666 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      323000 bytes
HTML transferred:       223000 bytes
Requests per second:    272.77 [#/sec] (mean)
Time per request:       183.303 [ms] (mean)
Time per request:       3.666 [ms] (mean, across all concurrent requests)
Transfer rate:          86.04 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   6.2      0      35
Processing:     0  175  31.1    172     252
Waiting:        0   98  54.0     94     227
Total:          0  178  31.2    175     256

Percentage of the requests served within a certain time (ms)
  50%    175
  66%    188
  75%    197
  80%    200
  90%    216
  95%    227
  98%    240
  99%    245
 100%    256 (longest request)